LetMeShip_Example.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ws="http://v20.shipping.ws.lms.italogistics.com/">
	<soapenv:Header>
		<oas:Security>
			<oas:usernameToken>
				<oas:apiId>xxxxxx</oas:apiId>
				<oas:apiPassword>xxxxxxx</oas:apiPassword>
			</oas:usernameToken>
		</oas:Security>
	</soapenv:Header>
	<soapenv:Body>
		<ws:AvailableServicesRequest>
			<clientInfo>
				<version>2.0</version>
				<language>en</language>
			</clientInfo>
			<pickupAddress>
				<countryCode>de</countryCode>
				<zip>20140</zip>
				<city>Hamburg</city>
				<street>Sender street</street>
				<company>Sender company</company>
				<lastName>Sender</lastName>
				<phoneNumber>100100100</phoneNumber>
				<phonePrefix>+49</phonePrefix>
				<email>alice.sender@sendercompany.xyz</email>
			</pickupAddress>
			<deliveryAddress>
				<countryCode>de</countryCode>
				<zip>81920</zip>
				<city>Munchen</city>
				<street>Receiver street</street>
				<lastName>Receiver</lastName>
				<phoneNumber>200200200</phoneNumber>
				<phonePrefix>49</phonePrefix>
			</deliveryAddress>
			<shipmentDetails>
				<shipmentType>parcel</shipmentType>
				<goodsValue>12.50</goodsValue>
				<parcels>
					<parcel>
						<height>40</height>
						<width>40</width>
						<length>50</length>
						<weight>1.5</weight>
						<quantity>2</quantity>
					</parcel>
				</parcels>
				<pickupInterval>
					<date>2012-09-29</date>
					<timeFrom>10:00:00</timeFrom>
					<timeTo>16:00:00</timeTo>
				</pickupInterval>
				<contentDescription>sample content</contentDescription>
				<serviceType>express</serviceType>
			</shipmentDetails>
		</ws:AvailableServicesRequest>
	</soapenv:Body>
</soapenv:Envelope>